openmv/openmv/ports/stm32/omv_csi.c
/*
 * Copyright (C) 2023-2024 OpenMV, LLC.
 *
 * Redistribution and use in source and binary forms, with or without
 * modification, are permitted provided that the following conditions
 * are met:
 *
 * 1. Redistributions of source code must retain the above copyright
 *    notice, this list of conditions and the following disclaimer.
 * 2. Redistributions in binary form must reproduce the above copyright
 *    notice, this list of conditions and the following disclaimer in
 *    the documentation and/or other materials provided with the
 *    distribution.
 * 3. Any redistribution, use, or modification in source or binary form
 *    is done solely for personal benefit and not for any commercial
 *    purpose or for monetary gain. For commercial licensing options,
 *    please contact openmv@openmv.io
 *
 * THIS SOFTWARE IS PROVIDED BY THE LICENSOR AND COPYRIGHT OWNER "AS IS"
 * AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO,
 * THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR
 * PURPOSE ARE DISCLAIMED. IN NO EVENT SHALL THE LICENSOR OR COPYRIGHT
 * OWNER BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL,
 * EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO,
 * PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR
 * PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY
 * OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT
 * (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE
 * OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
 *
 * STM32 CSI driver.
 */
#include <string.h>
#include <stdint.h>
#include <stdbool.h>
#include <stdio.h>
#include "py/mphal.h"
#include "irq.h"
#include "omv_boardconfig.h"
#include "unaligned_memcpy.h"
#include "omv_gpio.h"
#include "omv_i2c.h"
#include "omv_csi.h"
#include "stm_dma.h"
#include "stm_isp.h"
#include "stm_pwm.h"

#if defined(DCMIPP)
#define USE_DCMIPP          (1)
// NOTE using PIPE1.
#define DCMIPP_PIPE         (DCMIPP_PIPE1)
#endif

#if defined(PSSI)
#define DCMI_IRQn           DCMI_PSSI_IRQn
#define DCMI_IRQHandler     DCMI_PSSI_IRQHandler
#define DMA_PRIORITY_HIGH   DMA_HIGH_PRIORITY
#endif

#if defined(OMV_MDMA_CHANNEL_DCMI_0)
#define USE_MDMA            (1)
#endif

#ifndef OMV_CSI_DMA_XFER_PORTS
#define OMV_CSI_DMA_XFER_PORTS  (0)
#endif

#ifndef OMV_CSI_DMA_MAX_SIZE
#define OMV_CSI_DMA_MAX_SIZE    (0xFFFFU * 4U)
#endif

#ifndef OMV_CSI_LINE_ALIGNMENT
#define OMV_CSI_LINE_ALIGNMENT  (16)
#endif

typedef enum {
    CSI_HANDLE_DCMI = 0,
    CSI_HANDLE_DCMIPP = 1,
} csi_handle_t;

extern uint8_t _line_buf;
// Stores the CSI handle associated with DCMI/DCMIPP.
static omv_csi_t *stm_csi_all[2] = { 0 };

#if defined(STM32N6)
static DMA_QListTypeDef dma_queue;
// Nodes can't be places in CSI state because the need to be uncacheable.
static DMA_NodeTypeDef OMV_ATTR_SECTION(dma_nodes[2], ".dma_buffer");
#endif

void DCMI_IRQHandler(void) {
    omv_csi_t *csi = stm_csi_all[CSI_HANDLE_DCMI];
    HAL_DCMI_IRQHandler(&csi->dcmi);
}

#if USE_DCMIPP
void CSI_IRQHandler(void) {
    omv_csi_t *csi = stm_csi_all[CSI_HANDLE_DCMIPP];
    HAL_DCMIPP_CSI_IRQHandler(&csi->dcmipp);
}

void DCMIPP_IRQHandler(void) {
    omv_csi_t *csi = stm_csi_all[CSI_HANDLE_DCMIPP];
    HAL_DCMIPP_IRQHandler(&csi->dcmipp);
}
#endif

#if USE_MDMA
void omv_csi_mdma_irq_handler(void) {
    omv_csi_t *csi = stm_csi_all[CSI_HANDLE_DCMI];

    if (MDMA->GISR0 & (1 << OMV_MDMA_CHANNEL_DCMI_0)) {
        HAL_MDMA_IRQHandler(&csi->mdma0);
    }
    if (MDMA->GISR0 & (1 << OMV_MDMA_CHANNEL_DCMI_1)) {
        HAL_MDMA_IRQHandler(&csi->mdma1);
    }
}
#endif

static bool stm_csi_is_active(omv_csi_t *csi) {
    #if USE_DCMIPP
    if (csi->mipi_if) {
        return (DCMIPP->P1FCTCR & DCMIPP_P1FCTCR_CPTREQ);
    }
    #endif
    return (DCMI->CR & DCMI_CR_ENABLE);
}

static int stm_csi_config(omv_csi_t *csi, omv_csi_config_t config) {
    if (config == OMV_CSI_CONFIG_INIT) {
        if (!csi->mipi_if) {
            // Configure and initialize DMA.
            if (stm_dma_init(&csi->dma, OMV_CSI_DMA_CHANNEL, OMV_CSI_DMA_REQUEST,
                        DMA_PERIPH_TO_MEMORY, 4, 4, OMV_CSI_DMA_XFER_PORTS,
                        &stm_dma_csi_init, true)) {
                return OMV_CSI_ERROR_DMA_INIT_FAILED;
            }

            #if defined(STM32N6)
            // Initialize DMA in circular mode.
            if (stm_dma_ll_init(&csi->dma, &dma_queue, dma_nodes,
                        OMV_ARRAY_SIZE(dma_nodes), OMV_CSI_DMA_LIST_PORTS)) {
                return OMV_CSI_ERROR_CSI_INIT_FAILED;
            }
            #endif

            // Set DMA IRQ handle
            stm_dma_set_irq_descr(OMV_CSI_DMA_CHANNEL, &csi->dma);

            // Configure the DMA IRQ Channel
            csi->dma_irqn = stm_dma_channel_to_irqn(OMV_CSI_DMA_CHANNEL);
            NVIC_SetPriority(csi->dma_irqn, IRQ_PRI_DMA21);

            #if USE_MDMA
            csi->mdma0.Instance = MDMA_CHAN_TO_INSTANCE(OMV_MDMA_CHANNEL_DCMI_0);
            csi->mdma1.Instance = MDMA_CHAN_TO_INSTANCE(OMV_MDMA_CHANNEL_DCMI_1);
            #endif

            csi->dcmi.Instance = DCMI;
            csi->dcmi.Init.VSPolarity = csi->vsync_pol ? DCMI_VSPOLARITY_HIGH : DCMI_VSPOLARITY_LOW;
            csi->dcmi.Init.HSPolarity = csi->hsync_pol ? DCMI_HSPOLARITY_HIGH : DCMI_HSPOLARITY_LOW;
            csi->dcmi.Init.PCKPolarity = csi->pixck_pol ? DCMI_PCKPOLARITY_RISING : DCMI_PCKPOLARITY_FALLING;
            csi->dcmi.Init.SynchroMode = DCMI_SYNCHRO_HARDWARE;
            csi->dcmi.Init.CaptureRate = DCMI_CR_ALL_FRAME;
            csi->dcmi.Init.ExtendedDataMode = DCMI_EXTEND_DATA_8B;
            csi->dcmi.Init.JPEGMode = DCMI_JPEG_DISABLE;

            // Link the DMA handle to the DCMI handle
            __HAL_LINKDMA(&csi->dcmi, DMA_Handle, csi->dma);

            // Initialize the DCMI
            HAL_DCMI_DeInit(&csi->dcmi);
            if (HAL_DCMI_Init(&csi->dcmi) != HAL_OK) {
                return OMV_CSI_ERROR_CSI_INIT_FAILED;
            }

            // Store CSI handle used for DCMI
            stm_csi_all[CSI_HANDLE_DCMI] = csi;

            // Configure and enable DCMI IRQ Channel
            NVIC_SetPriority(DCMI_IRQn, IRQ_PRI_DCMI);
            HAL_NVIC_EnableIRQ(DCMI_IRQn);
        } else {
            #if USE_DCMIPP
            // Initialize the DCMIPP
            csi->dcmipp.Instance = DCMIPP;

