openmv/openmv/ports/stm32/omv_csi.c
    return 0;
}

static void stm_csi_frame_event(omv_csi_t *csi, uint32_t pipe) {
    framebuffer_t *fb = csi->fb;

    #if USE_MDMA
    // Clear out any stale flags.
    DMA2->LIFCR = DMA_FLAG_TCIF1_5 | DMA_FLAG_HTIF1_5;
    // Re-enable the DMA IRQ to catch the next start line.
    HAL_NVIC_EnableIRQ(csi->dma_irqn);
    #endif

    csi->first_line = false;
    if (csi->drop_frame) {
        // Reset the buffer's state if the frame was dropped.
        vbuffer_t *buffer = framebuffer_release(fb, FB_FLAG_FREE | FB_FLAG_PEEK);
        memset(buffer, 0, sizeof(vbuffer_t));
        return;
    }

    // Release the buffer from free queue -> used queue.
    framebuffer_release(fb, FB_FLAG_FREE | FB_FLAG_CHECK_LAST);

    if (csi->frame_cb.fun) {
        csi->frame_cb.fun(csi->frame_cb.arg);
    }

    #if defined(STM32N6)
    // Acquire a buffer from the free queue.
    vbuffer_t *buffer = framebuffer_acquire(fb, FB_FLAG_FREE | FB_FLAG_PEEK, 0);
    //printf("next buffer 0x%p\n", buffer);

    if (buffer == NULL) {
        omv_csi_abort(csi, false, false);
    } else if (csi->mipi_if) {
        HAL_DCMIPP_PIPE_SetMemoryAddress(&csi->dcmipp, pipe,
                                         DCMIPP_MEMORY_ADDRESS_0, (uint32_t) buffer->data);
    } else if (csi->one_shot) {
        HAL_DCMI_Stop(&csi->dcmi);
        HAL_DCMI_Start_DMA(&csi->dcmi, DCMI_MODE_SNAPSHOT, (uint32_t) buffer->data, csi->dma_size);
    }
    #endif  // STM32N6
}

void HAL_DCMI_FrameEventCallback(DCMI_HandleTypeDef *hdcmi) {
    stm_csi_frame_event(OMV_CONTAINER_OF(hdcmi, omv_csi_t, dcmi), 0);
}

#if USE_DCMIPP
void HAL_DCMIPP_PIPE_FrameEventCallback(DCMIPP_HandleTypeDef *hdcmi, uint32_t pipe) {
    stm_csi_frame_event(OMV_CONTAINER_OF(hdcmi, omv_csi_t, dcmipp), pipe);
}
#endif

#if defined(STM32F4) || defined(STM32F7) || defined(STM32H7)
// This function is called after each transfer is complete,
// with a pointer to the buffer that was used.
void DCMI_DMAConvCpltUser(DCMI_HandleTypeDef *hdcmi, uint32_t addr) {
    omv_csi_t *csi = OMV_CONTAINER_OF(hdcmi, omv_csi_t, dcmi);
    framebuffer_t *fb = csi->fb;

    // Throttle frames to match the current frame rate.
    omv_csi_throttle_framerate(csi);

    if (csi->drop_frame) {
        #if USE_MDMA
        if (!csi->transpose) {
            HAL_NVIC_DisableIRQ(csi->dma_irqn);
        }
        #endif
        return;
    }

    // Acquire a buffer from the free queue.
    vbuffer_t *buffer = framebuffer_acquire(fb, FB_FLAG_FREE | FB_FLAG_PEEK, 0);
    if (buffer == NULL) {
        omv_csi_abort(csi, false, true);
        return;
    }

    if (csi->pixformat == PIXFORMAT_JPEG) {
        if (csi->jpg_format == 3) {
            // JPEG MODE 3: Variable line width per frame, with the last line
            // potentially shorter and no padding. `offset` is incremented once
            // every max transfer, and the DMA counter holds the total size.
            buffer->offset += 1;
        } else if (csi->jpg_format == 4) {
            // JPEG MODE 4: Fixed width and height per frame. Each line starts
            // with two bytes indicating valid data length, followed by image
            // data and optional padding (0xFF). `offset` holds the total size.
            uint16_t size = __REV16(*((uint16_t *) addr));
            if (buffer->offset + size > framebuffer_get_buffer_size(fb)) {
                buffer->flags |= VB_FLAG_OVERFLOW;
                return;
            }
            unaligned_memcpy(buffer->data + buffer->offset, ((uint16_t *) addr) + 1, size);
            buffer->offset += size;
        }
        return;
    }

    #if USE_MDMA
    // DCMI_DMAConvCpltUser is called with the other MAR register.
    // So, we have to fix the address in full MDMA offload mode.
    if (!csi->transpose) {
        addr = (uint32_t) &_line_buf;
    }
    #endif

    uint32_t bytes_per_pixel = omv_csi_get_src_bpp(csi);
    uint8_t *src = ((uint8_t *) addr) + (fb->x * bytes_per_pixel) - get_dcmi_hw_crop(csi, bytes_per_pixel);
    uint8_t *dst = buffer->data;

    if (csi->pixformat == PIXFORMAT_GRAYSCALE) {
        bytes_per_pixel = sizeof(uint8_t);
    }

    #if USE_MDMA
    // For non-JPEG, non-transposed modes, offload the capture to MDMA.
    // Note that MDMA is started here, not in FRAME/VSYNC callbacks, to
    // maximize the time before the frame has to be dropped.
    if (!csi->transpose) {
        stm_mdma_start(csi, (uint32_t) src, (uint32_t) dst, fb->u * bytes_per_pixel, fb->v);
        HAL_NVIC_DisableIRQ(csi->dma_irqn);
        return;
    }
    #endif

    if (!csi->transpose) {
        dst += fb->u * bytes_per_pixel * buffer->offset++;
    } else {
        dst += bytes_per_pixel * buffer->offset++;
    }

    #if USE_MDMA
    // Two MDMA channels are used to maximize the time available to finish the transfer.
    omv_csi_copy_line(csi, (buffer->offset % 2) ? &csi->mdma1 : &csi->mdma0, src, dst);
    #else
    omv_csi_copy_line(csi, NULL, src, dst);
    #endif
}
#endif  // #if defined(STM32F4) || defined(STM32F7) || defined(STM32H7)

static int stm_csi_snapshot(omv_csi_t *csi, image_t *image, uint32_t flags) {
    vbuffer_t *buffer = NULL;
    framebuffer_t *fb = csi->fb;

    if (csi->pixformat == PIXFORMAT_INVALID) {
        return OMV_CSI_ERROR_INVALID_PIXFORMAT;
    }

    if (csi->framesize == OMV_CSI_FRAMESIZE_INVALID) {
        return OMV_CSI_ERROR_INVALID_FRAMESIZE;
    }

    // Compress the framebuffer for the IDE preview, if not the first frame, the
    // framebuffer is enabled, and the image sensor doesn't support JPEG encoding.
    if (flags & OMV_CSI_CAPTURE_FLAGS_UPDATE) {
        image_t tmp;
        framebuffer_init_image(fb, &tmp);
        framebuffer_update_jpeg_buffer(&tmp);
    }

    // Ensure that the raw frame fits into the FB. It will be switched from RGB565
    // to BAYER first to save space before being cropped until it fits.
    omv_csi_auto_crop_framebuffer(csi);

    // Restore frame buffer width and height if they were changed before. BPP is
    // restored later. Note that JPEG compression is done first on the framebuffer
    // with the user settings.
    uint32_t w = fb->u;
    uint32_t h = fb->v;

    // Release the buffer from used queue -> free queue.
    framebuffer_release(fb, FB_FLAG_USED | FB_FLAG_INVALIDATE);

    // Configure and start the capture.
    if (!stm_csi_is_active(csi)) {
        // Acquire a free buffer from the free queue.
        if (!(buffer = framebuffer_acquire(fb, FB_FLAG_FREE | FB_FLAG_PEEK, 0))) {
            return OMV_CSI_ERROR_FRAMEBUFFER_ERROR;
        }

