openmv/openmv/ports/stm32/omv_csi.c
        if (csi->mipi_if) {
            #if USE_DCMIPP
            uint32_t bytes_per_pixel = omv_csi_get_dst_bpp(csi);
            uint32_t line_width = fb->u * bytes_per_pixel;

            if (!line_width ||
                line_width % OMV_CSI_LINE_ALIGNMENT) {
                return OMV_CSI_ERROR_INVALID_FRAMESIZE;
            }

            // Configure crop
            DCMIPP_CropConfTypeDef ccfg = {
                .HStart = fb->x,
                .VStart = fb->y,
                .HSize = fb->u,
                .VSize = fb->v,
            };
            if (HAL_DCMIPP_PIPE_SetCropConfig(&csi->dcmipp, DCMIPP_PIPE, &ccfg) != HAL_OK ||
                HAL_DCMIPP_PIPE_EnableCrop(&csi->dcmipp, DCMIPP_PIPE) != HAL_OK) {
                return OMV_CSI_ERROR_CSI_INIT_FAILED;
            }

            // Set output pitch
            if (HAL_DCMIPP_PIPE_SetPitch(&csi->dcmipp, DCMIPP_PIPE, line_width) != HAL_OK) {
                return OMV_CSI_ERROR_CSI_INIT_FAILED;
            }

            // Start the DCMIPP
            if (HAL_DCMIPP_CSI_PIPE_Start(&csi->dcmipp, DCMIPP_PIPE, DCMIPP_VIRTUAL_CHANNEL0,
                                          (uint32_t) buffer->data, DCMIPP_MODE_CONTINUOUS) != HAL_OK) {
                return OMV_CSI_ERROR_CAPTURE_FAILED;
            }
            #endif  // USE_DCMIPP
        } else {
            // Setup the size and address of the transfer
            uint32_t bytes_per_pixel = omv_csi_get_src_bpp(csi);
            uint32_t x_crop = get_dcmi_hw_crop(csi, bytes_per_pixel);
            uint32_t line_width = resolution[csi->framesize][0] * bytes_per_pixel;

            // Shrink the captured pixel count by one word to allow cropping to fix alignment.
            if (x_crop) {
                line_width -= 4;
            }

            csi->dma_size = line_width * h / 4;

            // Error out if the transfer size is not compatible with DMA transfer restrictions.
            if ((!line_width) || (line_width % 4) ||
                #if defined(OMV_LINE_BUF_SIZE)
                (line_width > (OMV_LINE_BUF_SIZE / 2)) ||
                #endif
                (!csi->dma_size) || (csi->dma_size % OMV_CSI_LINE_ALIGNMENT)) {
                return OMV_CSI_ERROR_INVALID_FRAMESIZE;
            }

            HAL_DCMI_DisableCrop(&csi->dcmi);
            if (csi->pixformat != PIXFORMAT_JPEG) {
                // Vertically crop the image. Horizontal cropping is done in software.
                HAL_DCMI_ConfigCrop(&csi->dcmi, x_crop, fb->y, line_width - 1, h - 1);
                HAL_DCMI_EnableCrop(&csi->dcmi);
            }

            #if USE_MDMA
            // Configure MDMA for non-JPEG modes. MDMA will be used to either
            // completely offload the transfer, in case of non-transposed mode
            // or copy transposed lines.
            if (csi->pixformat != PIXFORMAT_JPEG) {
                stm_mdma_init(csi, bytes_per_pixel, x_crop);
            }
            #endif

            // Reset the DMA state and re-enable it.
            #if defined(STM32F4) || defined(STM32F7) || defined(STM32H7)
            OMV_CSI_DMA_CHANNEL->CR &= ~(DMA_SxCR_CIRC | DMA_SxCR_CT | DMA_SxCR_DBM);
            #endif
            HAL_NVIC_EnableIRQ(csi->dma_irqn);

            // HAL_DCMI_Start_DMA and HAL_DCMI_Start_DMA_MB both perform circular transfers,
            // differing only in size, with an interrupt after every half of the transfer.
            if ((csi->pixformat == PIXFORMAT_JPEG) && (csi->jpg_format == 3)) {
                // Start a one-shot transfer to the framebuffer, used only for JPEG mode 3.
                uint32_t size = framebuffer_get_buffer_size(fb);
                csi->dma_size = IM_MIN(size, (OMV_CSI_DMA_MAX_SIZE * 2U)) / 4;
                csi->one_shot = true;
                HAL_DCMI_Start_DMA(&csi->dcmi, DCMI_MODE_SNAPSHOT, (uint32_t) buffer->data, csi->dma_size);
            #if USE_MDMA
            } else if ((csi->pixformat != PIXFORMAT_JPEG) && (!csi->transpose)) {
                // Special transfer mode that uses DMA in circular mode and MDMA
                // to move the lines to the final destination.
                ((DMA_Stream_TypeDef *) csi->dma.Instance)->CR |= DMA_SxCR_CIRC;
                HAL_DCMI_Start_DMA(&csi->dcmi, DCMI_MODE_CONTINUOUS, (uint32_t) &_line_buf, line_width / 4);
            #endif  // USE_MDMA
            } else {
                #if defined(STM32F4) || defined(STM32F7) || defined(STM32H7)
                // Start a multibuffer (line by line) transfer.
                HAL_DCMI_Start_DMA_MB(&csi->dcmi, DCMI_MODE_CONTINUOUS, (uint32_t) &_line_buf, csi->dma_size, h);
                #else
                csi->one_shot = true;
                HAL_DCMI_Start_DMA(&csi->dcmi, DCMI_MODE_SNAPSHOT, (uint32_t) buffer->data, csi->dma_size);
                #endif
            }
        }
    }

    // Trigger the camera if FSYNC is enabled.
    #if defined(OMV_CSI_FSYNC_PIN)
    if (csi->frame_sync) {
        omv_gpio_write(OMV_CSI_FSYNC_PIN, 1);
    }
    #endif

    #if USE_DCMI
    // In JPEG mode, enable the end of frame interrupt.
    if (DCMI->CR & DCMI_JPEG_ENABLE) {
        __HAL_DCMI_ENABLE_IT(&csi->dcmi, DCMI_IT_FRAME);
    }
    #endif

    // One shot DMA transfers must be invalidated.
    framebuffer_flags_t fb_flags = FB_FLAG_USED | FB_FLAG_PEEK |
                                   ((csi->one_shot) ? FB_FLAG_INVALIDATE : 0);

    // Wait for a frame to be ready.
    if (!(buffer = framebuffer_acquire(fb, fb_flags, OMV_CSI_TIMEOUT_MS))) {
        omv_csi_abort(csi, true, false);
        #if defined(OMV_CSI_FSYNC_PIN)
        if (csi->frame_sync) {
            omv_gpio_write(OMV_CSI_FSYNC_PIN, 0);
        }
        #endif
        return OMV_CSI_ERROR_CAPTURE_TIMEOUT;
    }

    //printf("snapshot buffer 0x%p\n", buffer);

    // In JPEG 3 mode, the transfer must be aborted as it waits for data indefinitely.
    if (!csi->mipi_if && (csi->pixformat == PIXFORMAT_JPEG) && (csi->jpg_format == 3)) {
        omv_csi_abort(csi, true, false);
    }

